*** jxml2sql
    :PROPERTIES:
    :ID:       f6134bdc-5b7a-4f51-9470-4c2f958b16cd
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/edu/boisestate/cs574/homework/hw1
#+end_src

#+RESULTS:
:results:
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 Java                   36         7961         3850         3188          923
 Org                     2          518          417            0          101
 XML                   150         3003         2434           82          487
===============================================================================
 Total                 188        11482         6701         3270         1511
===============================================================================
:end:

*** string-constraint-counting
    :PROPERTIES:
    :ID:       cb892fef-6883-4bd1-8437-e5f7cbd37028
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/edu/boisestate/string-constraint-counting
#+end_src

#+RESULTS:
:results:
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 BASH                    3           99           60           29           10
 Java                  119        28309        17203         6937         4169
 JSON                   90           90           90            0            0
 Markdown                1            1            0            1            0
 Shell                   8          465          258           79          128
 Plain Text             47         2694            0         2686            8
 XML                     4          189          182            0            7
===============================================================================
 Total                 272        31847        17793         9732         4322
===============================================================================
:end:

*** jdee-server
    :PROPERTIES:
    :ID:       0056d48b-0437-47e6-867d-9f38e4b44d95
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/com/github/jdee-emacs/jdee-server
#+end_src

#+RESULTS:
:results:
:end:

*** log4j
    :PROPERTIES:
    :ID:       5fe1769c-87cb-4c05-a27a-e5902fb94aa3
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/org/apache/logging-log4j2/log4j-core/
#+end_src

#+RESULTS:
:results:
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 Batch                   1           47           37            3            7
 Groovy                  1            1            1            0            0
 Java                 1230       158136        93032        47877        17227
 JavaScript              1            7            7            0            0
 JSON                   14          622          615            0            7
 Markdown                2          121            0           94           27
 Shell                   2          119           44           57           18
 Plain Text              1            4            0            3            1
 XML                   273        10734         6803         3433          498
 YAML                    7          190          176            0           14
===============================================================================
 Total                1532       169981       100715        51467        17799
===============================================================================
:end:

*** Eclipse Java Language Server?
    :PROPERTIES:
    :ID:       3e94afeb-8aa6-4a38-945b-a8fca72e888b
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/org/eclipse/eclipse.jdt.ls
#+end_src

#+RESULTS:
:results:
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 Batch                  13         1349         1028            0          321
 CSS                     5         1608         1429          134           45
 Java                  794       172594       129466        22743        20385
 JavaScript             15        32115        21320         6277         4518
 JSON                    1           12            9            0            3
 Shell                  13         2479         1727          491          261
 Plain Text              2           11            0            9            2
 XML                    82         3098         3019           28           51
-------------------------------------------------------------------------------
 HTML                   16         2269         2045          224            0
 |- JavaScript          13          437          389           48            0
 (Total)                           2706         2434          272            0
-------------------------------------------------------------------------------
 Markdown                2          518            0          436           82
 |- BASH                 1            2            2            0            0
 (Total)                            520            2          436           82
===============================================================================
 Total                 943       216492       160434        30390        25668
===============================================================================
:end:

*** Soot
    :PROPERTIES:
    :ID:       2f797e80-acfc-43d3-955e-c7d901d10228
    :END:

#+begin_src bash
tokei /home/kb/workspace/src/org/soot-oss/soot
#+end_src

#+RESULTS:
:results:
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 BASH                    1           40           34            1            5
 CSS                     2           16           14            0            2
 Java                 3670       648131       391231       183149        73751
 Julia                   1            5            5            0            0
 Makefile                6          101           59           13           29
 Markdown                2          223            0          145           78
 Perl                    1          239          191           29           19
 Shell                  12          147          105           13           29
 TeX                    45        16081        12155         1637         2289
 Plain Text              7         1882            0         1483          399
 XSL                    11         3199         2538          138          523
 XML                    15         9710         9389          219          102
-------------------------------------------------------------------------------
 HTML                   97        11617        10014          822          781
 |- JavaScript           1           14           12            2            0
 (Total)                          11631        10026          824          781
===============================================================================
 Total                3870       691405       425747       187651        78007
===============================================================================
:end:

